app/controllers/api/v1/books_controller.rb

SELECT "books".* FROM "books" ORDER BY created_at DESC
---
			def index
				books= Book.order('created_at DESC');

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
			def show
				book = Book.find(params[:id])

INSERT INTO "books" ("book_id", "book_title", "author", "publisher", "year", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["book_id", 4], ["book_title", "book"], ["author", "author"], ["publisher", "publisher"], ["year", 2004], ["created_at", "2021-11-16 13:32:39.537389"], ["updated_at", "2021-11-16 13:32:39.537389"]]
---
			def create

				book = Book.new(book_params)

				if book.save